Revit 2027 API
ParameterTypeId.BuildingpadThickness Property
 "Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BuildingpadThickness { get; }
Public Shared ReadOnly Property BuildingpadThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BuildingpadThickness {
	ForgeTypeId^ get ();
}
static member BuildingpadThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace